{
  "socials": [
    {
      "title": "GitHub",
      "link": "https://github.com/flygrounder"
    },
    {
      "title": "LinkedIn",
      "link": "https://linkedin.com/in/flygrounder/"
    },
    {
      "title": "Telegram",
      "link": "https://t.me/flygrounder"
    },
    {
      "title": "Хабр",
      "link": "https://habr.com/ru/users/flygrounder/"
    }
  ],
  "sections": [
    {
      "title": "Опыт работы",
      "entries": [
        {
          "title": "VK",
          "period": "Август 2025-Настоящее время",
          "tags": ["Бэкенд", "Go", "Python"],
          "image": "vk.svg",
          "points": [
            "Спроектировал и реализовал настройки безопасности мессенджера VK Workspace в админ-панели на основе гибкой тарификации: моё решение позволило не настраивать новую инфраструктуру доставки сообщений между сервисами, а переиспользовать существовавшую для других целей. В ходе работы над этой функциональностью представил схему работы, на которую затем опирались другие разработчики, реализовал свою часть в VK Workspace на Python, настроил тестовые стенды и тарифы для тестирования совместной работы фронтенда и бэкенда.",
            "Поддержал гибкую тарификацию в сервисах VK доска, CalDAV API, CardDAV API: опции тарификации теперь считываются из базы в Tarantool и используются для ограничения доступа к платным функциям. При реализации этой функциональности лучше познакомился с Kubernetes, особенностями распределённых баз данных, чистой архитектурой и её реализацией в сервисах на Go, работе с метриками и алёртами."
          ]
        },
        {
          "title": "Институт системного программирования им. В.П. Иванникова РАН",
          "period": "Октябрь 2023–Август 2025",
          "tags": ["Бэкенд", "Rust", "Scala"],
          "image": "ispras.png",
          "points": [
            "Разработал инструментарий для внутреннего языка запросов к базе знаний на языке Rust: автодополнение, линтер, перевод для мультиязычного поиска, импорт запросов на языке Cypher.",
            "Настроил сборку из одной кодовой базы микросервиса с GraphQL API и npm пакета, скомпилированного в Web Assembly, для интеграции с фронтендом.",
            "Интегрировал новые поисковые функции в бэкенд на Scala, затрагивающие как реляционный поиск в PostgreSQL, так и полнотекстовый в Elastic Search."
          ]
        },
        {
          "title": "Яндекс",
          "image": "yandex.webp",
          "period": "Июль 2021–Октябрь 2021",
          "tags": ["Бэкенд", "Go"],
          "points": [
            "Реализовал API на языке Go для управления ZFS снимками реплики базы данных MySQL и создания тестового окружения с определённого снимка с возможностью настройки репликации на других хостах.",
            "Обнаружил <a href=\"https://github.com/roadrunner-server/roadrunner/issues/772\">баг</a> связанный с многопоточностью в библиотеке RoadRunner, приводивший к периодическому зависанию запросов, научился воспроизводить, нашёл причину и сообщил о проблеме разработчику. На основе предоставленной мной информации, разработчик библиотеки исправил проблему."
          ]
        }
      ]
    },
    {
      "title": "Образование",
      "entries": [
        {
          "title": "НИУ ВШЭ",
          "image": "hse.svg",
          "tags": ["Магистратура"],
          "period": "Сентябрь 2023–Июнь 2025",
          "points": [
            "Поступил на программу магистратуры <a href=\"https://www.hse.ru/ma/sp/\">\"Системное программирование\"</a> чтобы разобраться в низкоуровневых аспектах программирования для написания более эффективного кода.",
            "Больше всего понравились курсы \"Конструирование ядра ОС\", \"Параллельное и распределённое программирование\", \"Базы данных\".",
            "Защитил диссертацию на тему \"Разработка языкового инструментария для языка TQL\""
          ]
        },
        {
          "title": "МГТУ им. Н.Э. Баумана",
          "image": "bmstu.svg",
          "period": "Сентябрь 2019–Июнь 2023",
          "tags": ["Бакалавриат"],
          "points": [
            "Поступил в бакалавриат на специальность \"Прикладная математика и информатика\", кафедра <a href=\"https://iu9.bmstu.ru/\">ИУ9</a>.",
            "Больше всего понравились курсы \"Базы данных\", \"Генерация оптимального кода\", \"Теория формальных языков\".",
            "Защитил выпускную квалификационную работу на тему \"Ускорение поиска плагиата на сервере тестирования\"",
            "Получил диплом с отличием."
          ]
        }
      ]
    },
    {
      "title": "Соревнования",
      "entries": [
        {
          "title": "VK Cup '22/23",
          "image": "vkcup.jpg",
          "tags": ["Бэкенд", "Go", "Алгоритмы"],
          "points": [
            "В квалификационном этапе сделал конвейер вычислений с помощью горутин и каналов. Вошёл в лучшие 256 участников и прошёл в отборочный этап.",
            "В отборочном этапе реализовал сортировку данных, превышающих объём оперативной памяти: в качестве алгоритма использовал внешнюю сортировку слиянием с сохранением промежуточных результатов в файл. Вошёл в 16 лучших участников и прошёл в финал соревнования.",
            "В финале разработал программу, обходящую сайт в порядке обхода в ширину и составляющую коллаж из картинок. Данные в память не помещались, поэтому разобрался как устроен формат PNG и написал побайтовую генерацию изображения.",
            "Занял 7-ое место по результатам финального тестирования."
          ]
        },
        {
          "title": "Финал северной Евразии ICPC '21/22 и '22/23",
          "tags": ["Бакалавриат", "C++", "Алгоритмы"],
          "image": "icpc.png",
          "points": [
            "С первого курса каждый год участвовал в ICPC в качестве капитана команды от МГТУ им. Баумана.",
            "Дважды вышли в финал северной Евразии, оба раза стали призёрами, получив диплом 3-ей степени."
          ]
        }
      ]
    },
    {
      "title": "Выступления",
      "entries": [
        {
          "title": "SYRCoSE 2024",
          "tags": ["Магистратура"],
          "image": "syrcose.jpg",
          "points": [
            "Выступил с докладом на тему \"TQL: тематическое исследование внедрения предметно-ориентированного языка в продукт\". Мою статью по результатам выступления <a href=\"https://ispranproceedings.elpub.ru/jour/article/view/1787\">опубликовали</a> в журнале \"Труды Института системного программирования РАН\"."
          ]
        }
      ]
    }
  ]
}
